package com.zhang.util;



//此接口用来存放一般常量！

public interface InfoConstant {
	
	int DrawerLayoutSlideLength = 300 ; 
	int SelectClass = 111 ; 
	int AddClass = 112 ; 
	int Login = 113 ; 
	
	String TeacherID = "teacherID" ; 
	String TeacherName = "teacherName" ; 
	String TeacherPassword = "teacherPassword" ; 
	
	String tencentAppId = "222222"; //腾讯的分享ID
	
	
	int FromAddActivity = 100;
	String[] SCHOOL = {"武汉大学", "华中科技大学", "武汉理工大学", "武汉科技大学", "湖北大学"} ; 
	//全国所有学校的数组
	
	String[] BOY = {"小屁孩儿", "小屁孩儿", "小屁孩儿", "小屁孩儿", "小屁孩儿", "小屁孩儿", "小屁孩儿", "小屁孩儿", "小学生", "小学生",
			"小学生", "小学生", "小学生", "初中生", "初中生", "初中生", "小鲜肉", "学霸君", "高考生", "学弟",
			"小鲜肉", "学霸君", "学长", "牛奋男", "男神范儿", "欧巴", "牛奋男", "白马王子", "孩他舅", "食草男",
			"经济适用男", "警察叔叔", "抠脚大汉", "孩子他爹", "大官人", "民工", "便当男", "孩子他爹", "警察叔叔", "抠脚大汉",
			"男神", "大官人", "奔五的人", "奔五的人", "大叔你好", "大叔你好", "抠脚大汉", "抠脚大汉", "孩子他爹", "奔五的人",
			"钻石王老五", "钻石王老五", "钻石王老五", "奔六的人", "奔六的人", "奔六的人", "五楼不费劲", "上五楼不费劲", "上五楼不费劲", "奔六的人",
			"老爷", "老爷", "老大爷", "老大爷", "隔壁老王", "隔壁老王", "隔壁老王", "隔壁老王", "隔壁老王", "隔壁老王",
			"老大爷", "老大爷", "老大爷", "老不死的", "老不死的", "老不死的", "老不死的", "隔壁老王", "隔壁老王", "隔壁老王",
			"太爷爷你好", "太爷爷你好", "老不死的", "老不死的", "老不死的", "老不死的", "老不死的", "老不死的", "老不死的", "老不死的",
			"太太爷你好", "太太爷你好", "太太爷你好", "太太爷你好", "老不死的", "老不死的", "老不死的", "老不死的", "老不死的", "老不死的"} ; 
	
	String[] Girl = {"小丫头片子", "小丫头片子", "小丫头片子", "小丫头片子", "小丫头片子", "小丫头片子", "小丫头片子", "小丫头片子", "小学生", "小学生",
			"小学生", "小学生", "小学生", "初中生", "初中生", "初中生", "萌妹纸", "少女时代", "高考生", "萌妹纸",
			"学妹", "大妹子", "女神范儿", "学姐大人", "祸水妞儿", "女神范儿", "大姐头", "小娘子", "孩他妈", "知心大姐",
			"老板娘", "给娘娘请安", "孩他妈", "知心大姐", "大姐头", "孩他妈", "给娘娘请安", "孩他妈", "老板娘", "阿姨你好",
			"给娘娘请安", "阿姨你好", "女神他妈", "女神他妈", "男神他妈", "男神他妈", "丈母娘", "丈母娘", "丈母娘", "丈母娘",
			"给娘娘请安", "阿婆", "婆婆", "奔六的人", "奔六的人", "奔六的人", "阿婆", "阿婆", "阿婆", "阿婆",
			"阿婆", "阿婆", "阿婆", "阿婆", "阿婆", "阿婆", "阿婆", "阿婆", "阿婆", "阿婆",
			"大妈", "大妈", "大妈", "大妈", "大妈", "大妈", "大妈", "大妈", "大妈", "大妈",
			"奶奶", "奶奶", "奶奶", "奶奶", "奶奶", "奶奶", "奶奶", "奶奶", "奶奶", "奶奶",
			"90", "1", "2", "3", "4", "5", "6", "7", "8", "9"} ; 
}
